## Data inconsistancies
`Due to`
1. The inconsistant formats
     1. Like inconsistanties in `date`
2. Inconsistant Naming conventions
     1. Like inconsistanties in `USA, united state,US`
3. Typographical Errors
     1. Mistakes in data entry
4. Duplication
5. Contradictory data
     1. like father age is less than son gets inconsistancies in the data

In [4]:
import pandas as pd

In [11]:
data = {
    'date': ['2021/01/01', '01-02-2021', '01-2021-03', '2021-01-04', '2021-01-05'],
    'country': ['USA', 'UK', 'Canada', 'USA', 'UK'],
    'name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    'sale_20': [100, 200, None, 400, 500],
    'sale_21': [110, 210, 310, 410, None]
}

#  convert and make pandas data frame
df = pd.DataFrame(data)

In [12]:
df.head()

         date country     name  sale_20  sale_21
0  2021/01/01     USA    Alice    100.0    110.0
1  01-02-2021      UK      Bob    200.0    210.0
2  01-2021-03  Canada  Charlie      NaN    310.0
3  2021-01-04     USA    Alice    400.0    410.0
4  2021-01-05      UK      Bob    500.0      NaN

In [15]:
# standardizing date format
df['date'] = pd.to_datetime(df['date'], errors='coerce')
#The errors='coerce' parameter is used to handle errors. When errors='coerce', invalid parsing will be 
# set as NaT (Not a Time).
df['date'] = df['date'].dt.strftime('%Y-%m-%d')

In [16]:
df.head()

         date country     name  sale_20  sale_21
0  2021-01-01     USA    Alice    100.0    110.0
1         NaN      UK      Bob    200.0    210.0
2         NaN  Canada  Charlie      NaN    310.0
3         NaN     USA    Alice    400.0    410.0
4         NaN      UK      Bob    500.0      NaN